{"data": [{"workout": "5 x 3 min / 2 min easy", "notes": "Do five 3 minute pieces. Row/ski/ride for two minutes at light pressure between each piece."}, {"workout": "2 x 2000m", "notes": "2000m work, 3 minutes rest, 2000m work."}, {"workout": "1 min, 2 min, 3 min, 4 min, 3 min, 2 min, 1 min pyramid / 1 min easy", "notes": "Seven intervals in a pyramid of 1-2-3-4-3-2-1 minutes, with one minute of rest in between each piece."}, {"workout": "4 x 1000m / 1 min easy", "notes": "Four 1000 meter pieces. One minute at light pressure between each 1000. (BikeErg: 2000m pieces)"}, {"workout": "5 x 1000m / 1 min easy", "notes": "Five 1000 meter pieces. One minute at light pressure between each 1000. (BikeErg: 2000m pieces)"}, {"workout": "2 min, 3 min, 4 min, 3 min, 2 min pyramid / 2 min easy", "notes": "Five intervals in a pyramid of 2-3-4-3-2 minutes, with two minutes of rest in between each piece."}, {"workout": "5 x 500m / 2 min easy", "notes": "Five 500 meter pieces. Two minutes at light pressure between each 500. (BikeErg: 1000m pieces)"}, {"workout": "5 x 1000m", "notes": "5 x 1000m with 60 seconds rest."}, {"workout": "6 x 500m / 1 min easy", "notes": "Complete six 500 meter pieces. Continue at light pressure between each 500. Note: for BikeErg, distance is 1000 meters."}, {"workout": "30 minute time trial", "notes": "Do a 30 minute time trial, going for your personal best. Then enter your result in the Online Ranking and see where you stand with others of your age, gender and weight class."}, {"workout": "3 x 1000m / 3 min easy", "notes": "Three 1000 meter pieces. Three minutes at light pressure between each 1000. (BikeErg: 2000m pieces)"}, {"workout": "2000m", "notes": "Do 2000m as fast as you can (4000m for BikeErg)"}, {"workout": "4000m", "notes": "4000m time trial"}, {"workout": "5 x 4 min / 1 min easy", "notes": "Five 4 minute pieces. One minute at light pressure between each piece."}, {"workout": "4 x 1500m / 2 min easy", "notes": "Complete four 1500 meter pieces. Continue at light pressure between each 1500. Note: for BikeErg, distance is 3000 meters."}, {"workout": "Push Past your 2k", "notes": "Begin with a set of six 500m intervals at a pace just slower than your 2k average 500m split. With the significant rest, you should be able to repeat your effort with a steady consistency through all 6 pieces.\nAfter a 5 minute rest, it's time to push your intensity up just a little as you approach six 250m intervals at a pace just a little faster than your 2k average 500m split. \nConsistency is key. This workout will help you find the capacity to push just a little harder."}, {"workout": "2500m, 3 minutes rest, 2000m", "notes": "2500m work, then 3 minutes rest, then 2000m work."}, {"workout": "3000m time trial", "notes": "Aim for your best effort at 3000m. The goal is to go hard, but not so hard that you are unable to finish the piece."}, {"workout": "4 x 4 min / 2 min easy", "notes": "Four 4 minute pieces. Two minutes at light pressure between each piece."}, {"workout": "5000m time trial", "notes": "5000 meter time trial, going for your personal best. Enter your result in the Online Ranking and see where you stand with others of your age, gender and weight class. (BikeErg: 10,000m)"}, {"workout": "4 x 3 min / 2 min easy", "notes": "Four 3 minute pieces. Two minutes at light pressure between each piece."}, {"workout": "5 x 750m / 2 min easy", "notes": "Five 750 meter pieces. Two minutes at light pressure between each 750. (BikeErg: 1500m pieces)"}, {"workout": "10,000 meter time trial", "notes": "10,000 meter time trial, going for your personal best. Enter your time in the Online Ranking and see where you stand with others of your age, gender and weight class. (BikeErg: 20,000m)"}, {"workout": "3000m, 3 minutes rest, 2000m", "notes": "3000m work, then 3 minutes rest, then 2000m work"}, {"workout": "High Intensity Interval Pyramid starting at 250 meters", "notes": "Set your monitor for a variable interval workout as follows, with no rest between intervals: 250m, 250m, 200m, 200m, 150m, 150m, 100m, 100m, 150m, 150m, 200m, 200m, 250m, 250m. The first 250m at a moderate pace, then 250m at an intense pace, then 200m moderate, then 200m intense, and so on down to 100 meters, then work your way back up to 250 meters in the same manner. Note: for BikeErg, distances are doubled."}, {"workout": "6 x 2 min / 1 min easy", "notes": "Row six 2 minute pieces. Row for one minute at light pressure between each piece."}]}